stm32duino/Arduino_Core_STM32/boards.txt
GenF4.name=Generic STM32F4 series

GenF4.build.vid=0x1EAF
GenF4.build.pid=0x0004
GenF4.vid.0=0x1EAF
GenF4.pid.0=0x0004

GenF4.build.core=arduino
GenF4.build.board=GenF4
GenF4.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# Black F407VE
# Support: Serial1 (USART1 on PA10, PA9)
# Default SPI: SPI (SPI1 on PB3,PB4,PB5 - NRF24 connector and W25Q16 (on board flash))
GenF4.menu.pnum.BLACK_F407VE=Black F407VE
GenF4.menu.pnum.BLACK_F407VE.upload.maximum_size=524288
GenF4.menu.pnum.BLACK_F407VE.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407VE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenF4.menu.pnum.BLACK_F407VE.build.board=BLACK_F407VE
GenF4.menu.pnum.BLACK_F407VE.build.series=STM32F4xx
GenF4.menu.pnum.BLACK_F407VE.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407VE.build.variant=BLACK_F407VE
GenF4.menu.pnum.BLACK_F407VE.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
GenF4.menu.upload_method.STLink=STLink
GenF4.menu.upload_method.STLink.upload.protocol=STLink
GenF4.menu.upload_method.STLink.upload.tool=stlink_upload

GenF4.menu.upload_method.serialMethod=Serial
GenF4.menu.upload_method.serialMethod.upload.protocol=maple_serial
GenF4.menu.upload_method.serialMethod.upload.tool=serial_upload

GenF4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF4.menu.upload_method.bmpMethod.upload.tool=bmp_upload

###############################
# Maple
Maple.name=Maple series

Maple.build.vid=0x1EAF
Maple.build.pid=0x0004
Maple.vid.0=0x1EAF
Maple.pid.0=0x0004

Maple.build.core=arduino
Maple.build.board=Maple
Maple.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# MAPLEMINI_F103CB board
# Support: Serial2 (USART2 on PA3, PA2) and Serial3 (USART3 on PB11, PB10)
Maple.menu.pnum.MAPLEMINI_F103CB=Maple Mini F103CB
Maple.menu.pnum.MAPLEMINI_F103CB.upload.maximum_size=131072
Maple.menu.pnum.MAPLEMINI_F103CB.upload.maximum_data_size=20480
Maple.menu.pnum.MAPLEMINI_F103CB.build.mcu=cortex-m3
Maple.menu.pnum.MAPLEMINI_F103CB.build.board=MAPLEMINI_F103CB
Maple.menu.pnum.MAPLEMINI_F103CB.build.series=STM32F1xx
Maple.menu.pnum.MAPLEMINI_F103CB.build.product_line=STM32F103xB
Maple.menu.pnum.MAPLEMINI_F103CB.build.variant=MAPLEMINI_F103CB
Maple.menu.pnum.MAPLEMINI_F103CB.build.cmsis_lib_gcc=arm_cortexM3l_math

# Upload menu
Maple.menu.upload_method.STLinkMethod=STLink
Maple.menu.upload_method.STLinkMethod.upload.protocol=STLink
Maple.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

Maple.menu.upload_method.serialMethod=Serial
Maple.menu.upload_method.serialMethod.upload.protocol=maple_serial
Maple.menu.upload_method.serialMethod.upload.tool=serial_upload

###############################
# RemRam

RemRam.name=RemRam series

RemRam.build.vid=0x0483
RemRam.build.pid=0x5711
RemRam.vid.0=0x0483
RemRam.pid.0=0x5711

RemRam.build.core=arduino
RemRam.build.board=RemRam
RemRam.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# REMRAM_V1 board
# Support: Serial1 (USART1 on PA10, PA9)
RemRam.menu.pnum.REMRAM_V1=RemRam v1
RemRam.menu.pnum.REMRAM_V1.upload.maximum_size=2097152
RemRam.menu.pnum.REMRAM_V1.upload.maximum_data_size=524288
RemRam.menu.pnum.REMRAM_V1.build.mcu=cortex-m7 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
RemRam.menu.pnum.REMRAM_V1.build.board=REMRAM_V1
RemRam.menu.pnum.REMRAM_V1.build.series=STM32F7xx
RemRam.menu.pnum.REMRAM_V1.build.product_line=STM32F765xx
RemRam.menu.pnum.REMRAM_V1.build.variant=REMRAM_V1
RemRam.menu.pnum.REMRAM_V1.build.cmsis_lib_gcc=arm_cortexM7l_math

# Virtual COM port
#RemRam.menu.usb.none=None
#RemRam.menu.usb.CDC=CDC
#RemRam.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DUSE_USB_FS

# Upload menu
RemRam.menu.upload_method.STLinkMethod=STLink
RemRam.menu.upload_method.STLinkMethod.upload.protocol=STLink
RemRam.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

RemRam.menu.upload_method.serialMethod=Serial
RemRam.menu.upload_method.serialMethod.upload.protocol=maple_serial
RemRam.menu.upload_method.serialMethod.upload.tool=serial_upload

################################################################################
# Serialx activation
Nucleo_144.menu.xserial.generic=Enabled with generic Serial
Nucleo_144.menu.xserial.none=Enabled without generic Serial
Nucleo_144.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_144.menu.xserial.disabled=Disabled (No Serial)
Nucleo_144.menu.xserial.disabled.build.xSerial=

Nucleo_64.menu.xserial.generic=Enabled with generic Serial
Nucleo_64.menu.xserial.none=Enabled without generic Serial
Nucleo_64.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_64.menu.xserial.disabled=Disabled (No Serial)
Nucleo_64.menu.xserial.disabled.build.xSerial=

Nucleo_32.menu.xserial.generic=Enabled with generic Serial
Nucleo_32.menu.xserial.none=Enabled without generic Serial
Nucleo_32.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_32.menu.xserial.disabled=Disabled (No Serial)
Nucleo_32.menu.xserial.disabled.build.xSerial=

Disco.menu.xserial.generic=Enabled with generic Serial
Disco.menu.xserial.none=Enabled without generic Serial
Disco.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Disco.menu.xserial.disabled=Disabled (No Serial)
Disco.menu.xserial.disabled.build.xSerial=

GenF103.menu.xserial.generic=Enabled with generic Serial
GenF103.menu.xserial.none=Enabled without generic Serial
GenF103.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF103.menu.xserial.disabled=Disabled (No Serial)
GenF103.menu.xserial.disabled.build.xSerial=

GenF4.menu.xserial.generic=Enabled with generic Serial
GenF4.menu.xserial.none=Enabled without generic Serial
GenF4.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF4.menu.xserial.disabled=Disabled (No Serial)
GenF4.menu.xserial.disabled.build.xSerial=

