stm32duino/Arduino_Core_STM32/boards.txt
Maple.menu.opt.osstd=Smallest (-Os default)
Maple.menu.opt.oslto=Smallest (-Os) with LTO
Maple.menu.opt.oslto.build.flags.optimize=-Os -flto
Maple.menu.opt.oslto.build.flags.ldspecs=-flto
Maple.menu.opt.o1std=Fast (-O1)
Maple.menu.opt.o1std.build.flags.optimize=-O1
Maple.menu.opt.o1std.build.flags.ldspecs=
Maple.menu.opt.o1lto=Fast (-O1) with LTO
Maple.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Maple.menu.opt.o1lto.build.flags.ldspecs=-flto
Maple.menu.opt.o2std=Faster (-O2)
Maple.menu.opt.o2std.build.flags.optimize=-O2
Maple.menu.opt.o2std.build.flags.ldspecs=
Maple.menu.opt.o2lto=Faster (-O2) with LTO
Maple.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Maple.menu.opt.o2lto.build.flags.ldspecs=-flto
Maple.menu.opt.o3std=Fastest (-O3)
Maple.menu.opt.o3std.build.flags.optimize=-O3
Maple.menu.opt.o3std.build.flags.ldspecs=
Maple.menu.opt.o3lto=Fastest (-O3) with LTO
Maple.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Maple.menu.opt.o3lto.build.flags.ldspecs=-flto
Maple.menu.opt.ogstd=Debug (-g)
Maple.menu.opt.ogstd.build.flags.optimize=-g -Og
Maple.menu.opt.ogstd.build.flags.ldspecs=

RemRam.menu.opt.osstd=Smallest (-Os default)
RemRam.menu.opt.oslto=Smallest (-Os) with LTO
RemRam.menu.opt.oslto.build.flags.optimize=-Os -flto
RemRam.menu.opt.oslto.build.flags.ldspecs=-flto
RemRam.menu.opt.o1std=Fast (-O1)
RemRam.menu.opt.o1std.build.flags.optimize=-O1
RemRam.menu.opt.o1std.build.flags.ldspecs=
RemRam.menu.opt.o1lto=Fast (-O1) with LTO
RemRam.menu.opt.o1lto.build.flags.optimize=-O1 -flto
RemRam.menu.opt.o1lto.build.flags.ldspecs=-flto
RemRam.menu.opt.o2std=Faster (-O2)
RemRam.menu.opt.o2std.build.flags.optimize=-O2
RemRam.menu.opt.o2std.build.flags.ldspecs=
RemRam.menu.opt.o2lto=Faster (-O2) with LTO
RemRam.menu.opt.o2lto.build.flags.optimize=-O2 -flto
RemRam.menu.opt.o2lto.build.flags.ldspecs=-flto
RemRam.menu.opt.o3std=Fastest (-O3)
RemRam.menu.opt.o3std.build.flags.optimize=-O3
RemRam.menu.opt.o3std.build.flags.ldspecs=
RemRam.menu.opt.o3lto=Fastest (-O3) with LTO
RemRam.menu.opt.o3lto.build.flags.optimize=-O3 -flto
RemRam.menu.opt.o3lto.build.flags.ldspecs=-flto
RemRam.menu.opt.ogstd=Debug (-g)
RemRam.menu.opt.ogstd.build.flags.optimize=-g -Og
RemRam.menu.opt.ogstd.build.flags.ldspecs=

# C Runtime Library
Nucleo_144.menu.rtlib.nano=Newlib Nano (default)
Nucleo_144.menu.rtlib.nano.build.flags.ldspecs=--specs=nano.specs
Nucleo_144.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_144.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_144.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_144.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_144.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_144.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_144.menu.rtlib.full=Newlib Standard
Nucleo_144.menu.rtlib.full.build.flags.ldspecs=

Nucleo_64.menu.rtlib.nano=Newlib Nano (default)
Nucleo_64.menu.rtlib.nano.build.flags.ldspecs=--specs=nano.specs
Nucleo_64.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_64.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_64.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_64.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_64.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_64.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_64.menu.rtlib.full=Newlib Standard
Nucleo_64.menu.rtlib.full.build.flags.ldspecs=

Nucleo_32.menu.rtlib.nano=Newlib Nano (default)
Nucleo_32.menu.rtlib.nano.build.flags.ldspecs=--specs=nano.specs
Nucleo_32.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_32.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_32.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_32.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_32.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_32.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_32.menu.rtlib.full=Newlib Standard
Nucleo_32.menu.rtlib.full.build.flags.ldspecs=

Disco.menu.rtlib.nano=Newlib Nano (default)
Disco.menu.rtlib.nano.build.flags.ldspecs=--specs=nano.specs
Disco.menu.rtlib.nanofp=Newlib Nano + Float Printf
Disco.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Disco.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Disco.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Disco.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Disco.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Disco.menu.rtlib.full=Newlib Standard
Disco.menu.rtlib.full.build.flags.ldspecs=

GenF103.menu.rtlib.nano=Newlib Nano (default)
GenF103.menu.rtlib.nano.build.flags.ldspecs=--specs=nano.specs
GenF103.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF103.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF103.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF103.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF103.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF103.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF103.menu.rtlib.full=Newlib Standard
GenF103.menu.rtlib.full.build.flags.ldspecs=

GenF4.menu.rtlib.nano=Newlib Nano (default)
GenF4.menu.rtlib.nano.build.flags.ldspecs=--specs=nano.specs
GenF4.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF4.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF4.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF4.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF4.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF4.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF4.menu.rtlib.full=Newlib Standard
GenF4.menu.rtlib.full.build.flags.ldspecs=

Maple.menu.rtlib.nano=Newlib Nano (default)
Maple.menu.rtlib.nano.build.flags.ldspecs=--specs=nano.specs
Maple.menu.rtlib.nanofp=Newlib Nano + Float Printf
Maple.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Maple.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Maple.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Maple.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Maple.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Maple.menu.rtlib.full=Newlib Standard
Maple.menu.rtlib.full.build.flags.ldspecs=

RemRam.menu.rtlib.nano=Newlib Nano (default)
RemRam.menu.rtlib.nano.build.flags.ldspecs=--specs=nano.specs
RemRam.menu.rtlib.nanofp=Newlib Nano + Float Printf
RemRam.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
RemRam.menu.rtlib.nanofs=Newlib Nano + Float Scanf
RemRam.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
RemRam.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
RemRam.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
RemRam.menu.rtlib.full=Newlib Standard
RemRam.menu.rtlib.full.build.flags.ldspecs=
